posts/2015-06-04-stringp-nil-error-in-emacs.org

#+date: <2015-06-04>
#+filetags: emacs
#+title: Stringp, Nil Error in Emacs


This is one of those posts that serve only to remind me of something in the future. My Emacs configuration was working well on one machine.  Whenever I opened dired on another machine, though, this error was returned:

=wrong type argument: stringp, nil=

Finally, I remembered that I had required GNU ls in my Emacs settings, and had not installed it on the machine in question. A quick "brew install coreutils" to install the GNU Command Line Tools with Homebrew did the trick.
